; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v3)
             (pred_12 ?v5 ?v1)
             (pred_2 ?v7 ?v1)
             (pred_6 ?v10 ?v7 )
	     (pred_4 ?v7)
             (pred_11 ?v12)
             (pred_10 ?v5)
             (pred_5 ?v1)
             (pred_3 ?v7)
             (pred_1 ?v5)
             (pred_7 ?v7)
             (pred_9 ))



(:action op_3
:parameters (?v2 ?v11 ?v6 ?v9)
:precondition (and (pred_11 ?v2) (pred_11 ?v11) (pred_10 ?v6) (pred_5 ?v9)
          (pred_8 ?v2 ?v11) (pred_12 ?v6 ?v9)
                   (pred_2 ?v11 ?v9) (pred_4 ?v2) 
                   (pred_3 ?v11) (pred_1 ?v6))
:effect (and  (pred_7 ?v11) (not (pred_3 ?v11))))


(:action op_5
:parameters (?v2 ?v4)
:precondition (and (pred_11 ?v2) (pred_11 ?v4)
               (pred_4 ?v2) (pred_8 ?v2 ?v4) (pred_7 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v2))))

(:action op_2
:parameters (?v2 ?v6)
:precondition (and (pred_11 ?v2) (pred_10 ?v6) 
                  (pred_4 ?v2) (pred_6 ?v6 ?v2) (pred_9 ))
:effect (and (pred_1 ?v6)
   (not (pred_6 ?v6 ?v2)) (not (pred_9 ))))


(:action op_1
:parameters (?v2 ?v13 ?v8)
:precondition (and (pred_11 ?v2) (pred_10 ?v13) (pred_10 ?v8)
                  (pred_4 ?v2) (pred_1 ?v8) (pred_6 ?v13 ?v2))
:effect (and (pred_1 ?v13) (pred_6 ?v8 ?v2)
        (not (pred_1 ?v8)) (not (pred_6 ?v13 ?v2))))

(:action op_4
:parameters (?v2 ?v6)
:precondition (and (pred_11 ?v2) (pred_10 ?v6) 
                  (pred_4 ?v2) (pred_1 ?v6))
:effect (and (pred_9 ) (pred_6 ?v6 ?v2) (not (pred_1 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_21 obj_19 obj_29 obj_27 obj_05 obj_18 obj_25 obj_28 obj_04 obj_24 obj_12 obj_09 obj_30 obj_14 obj_02 obj_08 obj_17 obj_23 obj_07 obj_01 obj_31 obj_15 obj_10 obj_06
    obj_16 obj_13 obj_03
    obj_11 obj_22 obj_20
    )

    (:init
       (pred_9)

       (pred_11 obj_26)
       (pred_11 obj_21)
       (pred_11 obj_19)
       (pred_11 obj_29)
       (pred_11 obj_27)
       (pred_11 obj_05)
       (pred_11 obj_18)
       (pred_11 obj_25)
       (pred_11 obj_28)
       (pred_11 obj_04)
       (pred_11 obj_24)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_30)
       (pred_11 obj_14)
       (pred_11 obj_02)
       (pred_11 obj_08)
       (pred_11 obj_17)
       (pred_11 obj_23)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_31)
       (pred_11 obj_15)
       (pred_11 obj_10)
       (pred_11 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_22)
       (pred_10 obj_20)

       (pred_8 obj_26 obj_05)
       (pred_8 obj_26 obj_21)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_26)
       (pred_8 obj_19 obj_25)
       (pred_8 obj_19 obj_29)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_29 obj_28)
       (pred_8 obj_29 obj_27)
       (pred_8 obj_29 obj_19)
       (pred_8 obj_27 obj_04)
       (pred_8 obj_27 obj_29)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_26)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_25)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_25 obj_09)
       (pred_8 obj_25 obj_28)
       (pred_8 obj_25 obj_19)
       (pred_8 obj_25 obj_18)
       (pred_8 obj_28 obj_30)
       (pred_8 obj_28 obj_04)
       (pred_8 obj_28 obj_29)
       (pred_8 obj_28 obj_25)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_27)
       (pred_8 obj_04 obj_28)
       (pred_8 obj_24 obj_02)
       (pred_8 obj_24 obj_12)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_12 obj_24)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_09 obj_25)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_30 obj_23)
       (pred_8 obj_30 obj_14)
       (pred_8 obj_30 obj_28)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_30)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_24)
       (pred_8 obj_08 obj_31)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_23)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_23 obj_10)
       (pred_8 obj_23 obj_07)
       (pred_8 obj_23 obj_30)
       (pred_8 obj_23 obj_17)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_23)
       (pred_8 obj_01 obj_31)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_31 obj_15)
       (pred_8 obj_31 obj_08)
       (pred_8 obj_31 obj_01)
       (pred_8 obj_15 obj_10)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_31)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_23)
       (pred_8 obj_10 obj_15)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_10)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_24)
       (pred_2  obj_06 obj_16)
       (pred_2  obj_09 obj_13)
       (pred_2  obj_24 obj_03)
       (pred_7 obj_26)
       (pred_7 obj_21)
       (pred_7 obj_19)
       (pred_7 obj_29)
       (pred_7 obj_27)
       (pred_7 obj_05)
       (pred_7 obj_18)
       (pred_7 obj_25)
       (pred_7 obj_28)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_30)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_17)
       (pred_7 obj_23)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_31)
       (pred_7 obj_15)
       (pred_7 obj_10)

       (pred_12  obj_11 obj_16)
       (pred_12  obj_22 obj_13)
       (pred_12  obj_20 obj_03)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_20 obj_12)
       (pred_4 obj_05)
    )

    (:goal (and
       (pred_6 obj_11 obj_27)
       (pred_6 obj_20 obj_27)
    ))
(:constraints
  (always (not (pred_4 obj_29)))
)
)

; plan
1. (op_5 obj_05 obj_18)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_18)
   goals met: 0 of 2
2. (op_5 obj_18 obj_12)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_12)
   goals met: 0 of 2
3. (op_2 obj_12 obj_20)
   deleted: (pred_6 obj_20 obj_12) (pred_9)
   added: (pred_1 obj_20)
   goals met: 0 of 2
4. (op_5 obj_12 obj_18)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_18)
   goals met: 0 of 2
5. (op_5 obj_18 obj_21)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_21)
   goals met: 0 of 2
6. (op_5 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 0 of 2
7. (op_4 obj_19 obj_20)
   deleted: (pred_1 obj_20)
   added: (pred_9) (pred_6 obj_20 obj_19)
   goals met: 0 of 2
8. (op_5 obj_19 obj_21)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_21)
   goals met: 0 of 2
9. (op_2 obj_21 obj_11)
   deleted: (pred_6 obj_11 obj_21) (pred_9)
   added: (pred_1 obj_11)
   goals met: 0 of 2
10. (op_5 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 0 of 2
11. (op_5 obj_19 obj_25)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_25)
   goals met: 0 of 2
12. (op_5 obj_25 obj_28)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_28)
   goals met: 0 of 2
13. (op_5 obj_28 obj_04)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_04)
   goals met: 0 of 2
14. (op_5 obj_04 obj_27)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_27)
   goals met: 0 of 2
15. (op_4 obj_27 obj_11)
   deleted: (pred_1 obj_11)
   added: (pred_9) (pred_6 obj_11 obj_27)
   goals met: 1 of 2
16. (op_5 obj_27 obj_04)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_04)
   goals met: 1 of 2
17. (op_5 obj_04 obj_28)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_28)
   goals met: 1 of 2
18. (op_5 obj_28 obj_25)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_25)
   goals met: 1 of 2
19. (op_5 obj_25 obj_19)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_19)
   goals met: 1 of 2
20. (op_2 obj_19 obj_20)
   deleted: (pred_6 obj_20 obj_19) (pred_9)
   added: (pred_1 obj_20)
   goals met: 1 of 2
21. (op_5 obj_19 obj_25)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_25)
   goals met: 1 of 2
22. (op_5 obj_25 obj_28)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_28)
   goals met: 1 of 2
23. (op_5 obj_28 obj_04)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_04)
   goals met: 1 of 2
24. (op_5 obj_04 obj_27)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_27)
   goals met: 1 of 2
25. (op_4 obj_27 obj_20)
   deleted: (pred_1 obj_20)
   added: (pred_9) (pred_6 obj_20 obj_27)
   goals met: 2 of 2
